#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/el-brando/gke_workspace/runs/run-pnHXULQsL4wZfbTQ

Waiting for the plan to start...

Terraform v1.0.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.gke_google_template.module.gke.random_string.cluster_service_account_suffix: Refreshing state... [id=1tfx]
module.gke_google_template.module.gke.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/brandonsgcp/serviceAccounts/tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com]
module.gke_google_template.module.gke.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=brandonsgcp/roles/logging.logWriter/serviceAccount:tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com]
module.gke_google_template.module.gke.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=brandonsgcp/roles/monitoring.metricWriter/serviceAccount:tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com]
module.gke_google_template.module.gke.random_shuffle.available_zones: Refreshing state... [id=-]
module.gke_google_template.module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=brandonsgcp/roles/monitoring.viewer/serviceAccount:tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com]
module.gke_google_template.module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=brandonsgcp/roles/stackdriver.resourceMetadata.writer/serviceAccount:tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.gke_google_template.module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0] has been changed
  ~ resource "google_project_iam_member" "cluster_service_account-monitoring_viewer" {
      ~ etag    = "BwXIXLnbmXk=" -> "BwXIXLpKfCI="
        id      = "brandonsgcp/roles/monitoring.viewer/serviceAccount:tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }
  # module.gke_google_template.module.gke.google_project_iam_member.cluster_service_account-metric_writer[0] has been changed
  ~ resource "google_project_iam_member" "cluster_service_account-metric_writer" {
      ~ etag    = "BwXIXLlo8KA=" -> "BwXIXLpKfCI="
        id      = "brandonsgcp/roles/monitoring.metricWriter/serviceAccount:tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }
  # module.gke_google_template.module.gke.google_project_iam_member.cluster_service_account-log_writer[0] has been changed
  ~ resource "google_project_iam_member" "cluster_service_account-log_writer" {
      ~ etag    = "BwXIXLjzyMI=" -> "BwXIXLpKfCI="
        id      = "brandonsgcp/roles/logging.logWriter/serviceAccount:tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gke_google_template.module.gke.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = 110
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + instance_group_urls         = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "us-west1"
      + logging_service             = "logging.googleapis.com/kubernetes"
      + master_version              = (known after apply)
      + min_master_version          = "1.20.8-gke.2100"
      + monitoring_service          = "monitoring.googleapis.com/kubernetes"
      + name                        = "test-cluster"
      + network                     = "projects/brandonsgcp/global/networks/kubenetwork"
      + networking_mode             = (known after apply)
      + node_locations              = [
          + "us-west1-a",
          + "us-west1-b",
          + "us-west1-c",
        ]
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "brandonsgcp"
      + remove_default_node_pool    = false
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "projects/brandonsgcp/regions/us-west1/subnetworks/kubesubnet"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = false
            }

          + http_load_balancing {
              + disabled = true
            }

          + network_policy_config {
              + disabled = true
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + enabled = false

          + auto_provisioning_defaults {
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }
        }

      + database_encryption {
          + state = "DECRYPTED"
        }

      + default_snat_status {
          + disabled = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "kupepods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "kubeservices"
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "05:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + network_policy {
          + enabled = false
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count  = 0
          + instance_group_urls = (known after apply)
          + max_pods_per_node   = (known after apply)
          + name                = "default-pool"
          + name_prefix         = (known after apply)
          + node_count          = (known after apply)
          + node_locations      = (known after apply)
          + version             = (known after apply)

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = false
              + service_account   = "tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com"
              + taint             = (known after apply)

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + node_metadata = "GKE_METADATA_SERVER"
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + release_channel {
          + channel = (known after apply)
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + vertical_pod_autoscaling {
          + enabled = false
        }

      + workload_identity_config {
          + identity_namespace = "brandonsgcp.svc.id.goog"
        }
    }

  # module.gke_google_template.module.gke.google_container_node_pool.pools["test-node-pool"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster             = "test-cluster"
      + id                  = (known after apply)
      + initial_node_count  = 80
      + instance_group_urls = (known after apply)
      + location            = "us-west1"
      + max_pods_per_node   = (known after apply)
      + name                = "test-node-pool"
      + name_prefix         = (known after apply)
      + node_count          = (known after apply)
      + node_locations      = (known after apply)
      + operation           = (known after apply)
      + project             = "brandonsgcp"
      + version             = (known after apply)

      + autoscaling {
          + max_node_count = 100
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = "pd-standard"
          + guest_accelerator = []
          + image_type        = "COS"
          + labels            = {
              + "cluster_name" = "test-cluster"
              + "node_pool"    = "test-node-pool"
            }
          + local_ssd_count   = 0
          + machine_type      = "e2-small"
          + metadata          = {
              + "cluster_name"             = "test-cluster"
              + "disable-legacy-endpoints" = "true"
              + "node_pool"                = "test-node-pool"
            }
          + oauth_scopes      = (known after apply)
          + preemptible       = false
          + service_account   = "tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com"
          + tags              = [
              + "gke-test-cluster",
              + "gke-test-cluster-test-node-pool",
            ]
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + node_metadata = "GKE_METADATA_SERVER"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # module.gke_google_template.module.gke.module.gcloud_delete_default_kube_dns_configmap.module.gcloud_kubectl.null_resource.module_depends_on[0] will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "2"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "GOOGLE_CREDENTIALS" but
│ a value was found in file "/terraform/terraform.tfvars". If you meant to
│ use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @notjosse, Action: `pull_request`*